results/Scaleway/ARM64-2GB/diskbench.log
$ date
Sat Apr 29 16:44:52 UTC 2017

$ fio "/root/serverbench/scripts/ssd.fio"
seq-read: (g=0): rw=read, bs=4K-4K/4K-4K/4K-4K, ioengine=libaio, iodepth=4
rand-read: (g=1): rw=randread, bs=4K-4K/4K-4K/4K-4K, ioengine=libaio, iodepth=4
seq-write: (g=2): rw=write, bs=4K-4K/4K-4K/4K-4K, ioengine=libaio, iodepth=4
rand-write: (g=3): rw=randwrite, bs=4K-4K/4K-4K/4K-4K, ioengine=libaio, iodepth=4
fio-2.2.10
Starting 4 processes
seq-read: Laying out IO file(s) (1 file(s) / 1024MB)

seq-read: (groupid=0, jobs=1): err= 0: pid=9192: Sat Apr 29 16:46:49 2017
  read : io=1024.0MB, bw=45867KB/s, iops=11466, runt= 22861msec
    slat (usec): min=9, max=12344, avg=71.84, stdev=64.32
    clat (usec): min=101, max=12978, avg=268.66, stdev=90.00
     lat (usec): min=193, max=13028, avg=343.65, stdev=92.94
    clat percentiles (usec):
     |  1.00th=[  163],  5.00th=[  163], 10.00th=[  165], 20.00th=[  258],
     | 30.00th=[  262], 40.00th=[  266], 50.00th=[  286], 60.00th=[  290],
     | 70.00th=[  294], 80.00th=[  298], 90.00th=[  306], 95.00th=[  322],
     | 99.00th=[  378], 99.50th=[  406], 99.90th=[  660], 99.95th=[ 1032],
     | 99.99th=[ 4128]
    bw (KB  /s): min=43696, max=46336, per=100.00%, avg=45868.98, stdev=528.53
    lat (usec) : 250=16.21%, 500=83.55%, 750=0.17%, 1000=0.02%
    lat (msec) : 2=0.03%, 4=0.01%, 10=0.01%, 20=0.01%
  cpu          : usr=16.61%, sys=82.13%, ctx=2108, majf=0, minf=24
  IO depths    : 1=0.1%, 2=0.1%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=262144/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=4
rand-read: (groupid=1, jobs=1): err= 0: pid=9196: Sat Apr 29 16:46:49 2017
  read : io=1024.0MB, bw=45085KB/s, iops=11271, runt= 23258msec
    slat (usec): min=11, max=4071, avg=70.24, stdev=54.13
    clat (usec): min=77, max=5822, avg=274.79, stdev=61.12
     lat (usec): min=202, max=5878, avg=348.54, stdev=58.16
    clat percentiles (usec):
     |  1.00th=[  165],  5.00th=[  167], 10.00th=[  171], 20.00th=[  262],
     | 30.00th=[  266], 40.00th=[  266], 50.00th=[  270], 60.00th=[  294],
     | 70.00th=[  298], 80.00th=[  302], 90.00th=[  326], 95.00th=[  338],
     | 99.00th=[  414], 99.50th=[  454], 99.90th=[  644], 99.95th=[  756],
     | 99.99th=[ 1688]
    bw (KB  /s): min=40568, max=45984, per=100.00%, avg=45089.91, stdev=1187.07
    lat (usec) : 100=0.01%, 250=12.93%, 500=86.77%, 750=0.25%, 1000=0.03%
    lat (msec) : 2=0.02%, 4=0.01%, 10=0.01%
  cpu          : usr=17.39%, sys=80.39%, ctx=3549, majf=0, minf=23
  IO depths    : 1=0.1%, 2=0.1%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=262144/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=4
seq-write: (groupid=2, jobs=1): err= 0: pid=9197: Sat Apr 29 16:46:49 2017
  write: io=1024.0MB, bw=36238KB/s, iops=9059, runt= 28936msec
    slat (usec): min=13, max=1452, avg=39.36, stdev=13.16
    clat (usec): min=150, max=334582, avg=394.90, stdev=1306.20
     lat (usec): min=215, max=334634, avg=436.46, stdev=1306.24
    clat percentiles (usec):
     |  1.00th=[  294],  5.00th=[  350], 10.00th=[  358], 20.00th=[  366],
     | 30.00th=[  370], 40.00th=[  378], 50.00th=[  386], 60.00th=[  390],
     | 70.00th=[  398], 80.00th=[  410], 90.00th=[  430], 95.00th=[  454],
     | 99.00th=[  502], 99.50th=[  532], 99.90th=[  684], 99.95th=[  876],
     | 99.99th=[ 3824]
    bw (KB  /s): min=12208, max=38120, per=99.98%, avg=36228.21, stdev=3544.99
    lat (usec) : 250=0.04%, 500=98.84%, 750=1.06%, 1000=0.03%
    lat (msec) : 2=0.03%, 4=0.01%, 10=0.01%, 500=0.01%
  cpu          : usr=12.46%, sys=43.09%, ctx=65911, majf=0, minf=24
  IO depths    : 1=0.1%, 2=0.1%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=262144/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=4
rand-write: (groupid=3, jobs=1): err= 0: pid=9198: Sat Apr 29 16:46:49 2017
  write: io=1024.0MB, bw=31179KB/s, iops=7794, runt= 33631msec
    slat (usec): min=11, max=1312, avg=39.93, stdev=12.30
    clat (usec): min=156, max=445741, avg=464.92, stdev=2604.24
     lat (usec): min=231, max=445776, avg=506.98, stdev=2604.36
    clat percentiles (usec):
     |  1.00th=[  330],  5.00th=[  378], 10.00th=[  390], 20.00th=[  414],
     | 30.00th=[  418], 40.00th=[  430], 50.00th=[  438], 60.00th=[  446],
     | 70.00th=[  458], 80.00th=[  478], 90.00th=[  506], 95.00th=[  548],
     | 99.00th=[  596], 99.50th=[  636], 99.90th=[  852], 99.95th=[ 1224],
     | 99.99th=[ 5856]
    bw (KB  /s): min=13919, max=33392, per=100.00%, avg=31510.31, stdev=3919.75
    lat (usec) : 250=0.02%, 500=89.02%, 750=10.80%, 1000=0.09%
    lat (msec) : 2=0.04%, 4=0.01%, 10=0.01%, 250=0.01%, 500=0.01%
  cpu          : usr=11.56%, sys=37.38%, ctx=65865, majf=0, minf=21
  IO depths    : 1=0.1%, 2=0.1%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=262144/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=4

Run status group 0 (all jobs):
   READ: io=1024.0MB, aggrb=45867KB/s, minb=45867KB/s, maxb=45867KB/s, mint=22861msec, maxt=22861msec

Run status group 1 (all jobs):
   READ: io=1024.0MB, aggrb=45084KB/s, minb=45084KB/s, maxb=45084KB/s, mint=23258msec, maxt=23258msec

Run status group 2 (all jobs):
  WRITE: io=1024.0MB, aggrb=36237KB/s, minb=36237KB/s, maxb=36237KB/s, mint=28936msec, maxt=28936msec

Run status group 3 (all jobs):
  WRITE: io=1024.0MB, aggrb=31178KB/s, minb=31178KB/s, maxb=31178KB/s, mint=33631msec, maxt=33631msec

Disk stats (read/write):
  vda: ios=524301/522784, merge=0/31, ticks=64048/164140, in_queue=226996, util=76.19%

$ sysbench --test=fileio --file-total-size=6G prepare
sysbench 0.4.12:  multi-threaded system evaluation benchmark

128 files, 49152Kb each, 6144Mb total
Creating files for the test...

$ sysbench --test=fileio --file-total-size=6G --file-test-mode=rndrw  --max-time=300 --max-requests=0 --file-extra-flags=direct run
sysbench 0.4.12:  multi-threaded system evaluation benchmark

Running the test with following options:
Number of threads: 1

Extra file open flags: 65536
128 files, 48Mb each
6Gb total file size
Block size 16Kb
Number of random requests for random IO: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random r/w test
Threads started!
Time limit exceeded, exiting...
Done.

Operations performed:  331440 Read, 220960 Write, 706973 Other = 1259373 Total
Read 5.0574Gb  Written 3.3716Gb  Total transferred 8.429Gb  (28.771Mb/sec)
 1841.32 Requests/sec executed

Test execution summary:
    total time:                          300.0027s
    total number of events:              552400
    total time taken by event execution: 157.0012
    per-request statistics:
         min:                                  0.21ms
         avg:                                  0.28ms
         max:                                 18.64ms
         approx.  95 percentile:               0.34ms

Threads fairness:
    events (avg/stddev):           552400.0000/0.00
    execution time (avg/stddev):   157.0012/0.00


$ sysbench --test=fileio --file-total-size=6G --file-test-mode=rndrw --max-time=300 --file-fsync-all --max-requests=0 --num-threads=8 run
sysbench 0.4.12:  multi-threaded system evaluation benchmark

Running the test with following options:
Number of threads: 8

Extra file open flags: 0
128 files, 48Mb each
6Gb total file size
Block size 16Kb
Number of random requests for random IO: 0
Read/Write ratio for combined random IO test: 1.50
Calling fsync() after each write operation.
Using synchronous I/O mode
Doing random r/w test
Threads started!
Time limit exceeded, exiting...
(last message repeated 7 times)
Done.

Operations performed:  897479 Read, 598326 Write, 598326 Other = 2094131 Total
Read 13.694Gb  Written 9.1297Gb  Total transferred 22.824Gb  (77.904Mb/sec)
 4985.85 Requests/sec executed

Test execution summary:
    total time:                          300.0099s
    total number of events:              1495805
    total time taken by event execution: 2396.6573
    per-request statistics:
         min:                                  0.01ms
         avg:                                  1.60ms
         max:                                 41.11ms
         approx.  95 percentile:               3.94ms

Threads fairness:
    events (avg/stddev):           186975.6250/1373.41
    execution time (avg/stddev):   299.5822/0.01


$ sysbench --test=fileio --file-total-size=6G --file-test-mode=rndrw --max-time=300 --file-fsync-all --max-requests=0 --num-threads=64 run
sysbench 0.4.12:  multi-threaded system evaluation benchmark

Running the test with following options:
Number of threads: 64

Extra file open flags: 0
128 files, 48Mb each
6Gb total file size
Block size 16Kb
Number of random requests for random IO: 0
Read/Write ratio for combined random IO test: 1.50
Calling fsync() after each write operation.
Using synchronous I/O mode
Doing random r/w test
Threads started!
Time limit exceeded, exiting...
(last message repeated 63 times)
Done.

Operations performed:  1783442 Read, 1188995 Write, 1188995 Other = 4161432 Total
Read 27.213Gb  Written 18.143Gb  Total transferred 45.356Gb  (154.81Mb/sec)
 9907.71 Requests/sec executed

Test execution summary:
    total time:                          300.0126s
    total number of events:              2972437
    total time taken by event execution: 19143.3814
    per-request statistics:
         min:                                  0.01ms
         avg:                                  6.44ms
         max:                                442.00ms
         approx.  95 percentile:              19.28ms

Threads fairness:
    events (avg/stddev):           46444.3281/375.90
    execution time (avg/stddev):   299.1153/0.07


$ sysbench --test=fileio --file-total-size=6G cleanup
sysbench 0.4.12:  multi-threaded system evaluation benchmark

Removing test files...